1s/ERP/extensions/liko/Documents/ТранспортнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТранспортнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресПогрузкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтомобильМарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтомобильГосударственныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчетПлательщика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдостоверениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчетЗаказчикаПеревозки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчетПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицензионнаяКарточкаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтпустилДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводДанныхОТоварномСоставе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыводаДанныхОТоварномСоставе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдостоверениеСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГосударственныйНомерПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоверенностьВыдана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоверенностьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказчикПеревозки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоверенностьЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоверенностьНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицензионнаяКарточкаВид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицензионнаяКарточкаРегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицензионнаяКарточкаСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтомобильВместимостьВКубическихМетрах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Плательщик</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтомобильТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвтомобильГрузоподъемностьВТоннах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серии</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасов</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/Лико_Диадок/Ext/Module.bsl
Процедура ДополнитьНаименованиеНоменклатуры(ТекущееНаименование, СтрокаДанных, Лико_ДиадокВыгружатьПоТребованиямPG, Лико_ДиадокВыгружатьНамотку) Экспорт // --> Начало Лико Ефимов ЕВВ 04.12.2024
		
	Если Лико_ДиадокВыгружатьПоТребованиямPG Тогда	
		// Уберем последнюю скобку
		ТекущееНаименование = Лев(ТекущееНаименование, СтрДлина(ТекущееНаименование)-1);
		// Выведем код этикетки заказчика, если он заполнен
		Если ЗначениеЗаполнено(СтрокаДанных.КодЭтикеткиЗаказчика) Тогда
			ТекущееНаименование = ТекущееНаименование + ?(СтрНайти(СтрокаДанных.КодЭтикеткиЗаказчика, "code") = 0, " code ", " ") + СокрЛП(СтрокаДанных.КодЭтикеткиЗаказчика);
		КонецЕсли;
		// Выведем номер контракта, если он заполнен
		Если ЗначениеЗаполнено(СтрокаДанных.NКонтракта) Тогда
			ТекущееНаименование = ТекущееНаименование + " контр. " + СокрЛП(Строка(СтрокаДанных.NКонтракта));
		КонецЕсли;
		// Вернем последнюю скобку
		ТекущееНаименование = ТекущееНаименование + ")";
	КонецЕсли;
	
	Если Лико_ДиадокВыгружатьНамотку Тогда	
		// Уберем последнюю скобку
		ТекущееНаименование = Лев(ТекущееНаименование, СтрДлина(ТекущееНаименование)-1);
		// Выведем намотку, если она заполнена
		Если ЗначениеЗаполнено(СтрокаДанных.Намотка) Тогда
			ТекущееНаименование = ТекущееНаименование + " нам. " + СокрЛП(Строка(СтрокаДанных.Намотка));
		КонецЕсли;
		// Вернем последнюю скобку
		ТекущееНаименование = ТекущееНаименование + ")";
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 04.12.2024

Процедура ЗаполнитьДопДанныеПоРеализации(Content, СчетФактура, Формат970 = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 22.10.2018
	
	ЭтоКорректировка = Ложь;
	Если ТипЗнч(СчетФактура.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Реализация = СчетФактура.ДокументОснование;
	ИначеЕсли ТипЗнч(СчетФактура.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Реализация = СчетФактура.ДокументОснование.ДокументОснование;
		Корректировка = СчетФактура.ДокументОснование;
		ЭтоКорректировка = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Реализация.Партнер, "ДиадокВыгружатьПоТребованиямPG_085e0f9cfdb0476b8d32c6e34a51ce1d", Ложь) Тогда
		// Это не P&G, ничего делать не нужно
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоКорректировка Тогда
		// Найдем тарнспортную накладную
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортнаяНакладная.Ссылка КАК Ссылка,
		|	ТранспортнаяНакладная.Номер КАК Номер,
		|	ТранспортнаяНакладная.Дата КАК Дата
		|ИЗ
		|	Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
		|ГДЕ
		|	(ВЫРАЗИТЬ(ТранспортнаяНакладная.ДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) = &Реализация
		|	И НЕ ТранспортнаяНакладная.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортнаяНакладная.Дата УБЫВ,
		|	ТранспортнаяНакладная.Номер";
		Запрос.УстановитьПараметр("Реализация", Реализация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураWaybill = Новый Структура("DocumentDate,DocumentNumber", Выборка.Дата, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));
			Если Content.TransferInfo.Свойство("Waybills") И ТипЗнч(Content.TransferInfo.Waybills) = Тип("Массив") Тогда
				Content.TransferInfo.Waybills.Добавить(СтруктураWaybill);
			КонецЕсли;
			Content.TransferInfo.TransferTextInfo = "Транспортная накладная № " + СтруктураWaybill.DocumentNumber + " от " + Формат(СтруктураWaybill.DocumentDate, "ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоКорректировка Тогда
		Для каждого Структура из Content.EventContent.CorrectionBases Цикл
			Структура.BaseDocumentName = Корректировка.Основание;
			Структура.BaseDocumentNumber = Корректировка.ОснованиеНомер;
			Структура.BaseDocumentDate = Корректировка.ОснованиеДата;
		КонецЦикла;
	КонецЕсли;				
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Характеристика,
	|	РеализацияТоваровУслугТовары.Характеристика.Лико_ЗаказНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Заказ КАК Заказ,
	|	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК NКонтракта
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ.Заказ = ЗаказКлиентаТовары.Ссылка
	|			И ВТ.Характеристика = ЗаказКлиентаТовары.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Заказ,
	|	ВТ.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ2.NКонтракта КАК NКонтракта
	|ИЗ
	|	ВТ2 КАК ВТ2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ2.NКонтракта
	|
	|УПОРЯДОЧИТЬ ПО
	|	NКонтракта";
	Запрос.УстановитьПараметр("Ссылка", Реализация);
	Выборка = Запрос.Выполнить().Выбрать();
	СтрокаРО = "";
	Пока Выборка.Следующий() Цикл
		НомерПоставки = СокрЛП(Выборка.NКонтракта);
		Если ЗначениеЗаполнено(НомерПоставки) Тогда
			СтрокаРО = СтрокаРО + НомерПоставки + ",";
		КонецЕсли;					
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрокаРО) Тогда
		СтрокаРО = Лев(СтрокаРО, СтрДлина(СтрокаРО)-1);
	КонецЕсли;
	//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "НаимБанк", Content.Seller.BankName));
	//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "БИК", Content.Seller.BankId));
	//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "НомерСчета", Content.Seller.BankAccountNumber));
	//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "РО", СтрокаРО));
	
	// Получим данные о счете
	Запрос = Новый Запрос;
	Если НЕ ЭтоКорректировка Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаДокумента,
		|	РеализацияТоваровУслугТовары.Ссылка.Договор.Номер КАК НомерДоговора,
		|	РеализацияТоваровУслугТовары.Ссылка.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РеализацияТоваровУслугТовары.Ссылка.ВалютаВзаиморасчетов.Наименование КАК ВалютаВзаиморасчетовНаименование,
		|	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС) КАК СуммаСНДС,
		|	РеализацияТоваровУслугТовары.Ссылка.БанковскийСчетОрганизации.Банк.Наименование КАК НаимБанк,
		|	РеализацияТоваровУслугТовары.Ссылка.БанковскийСчетОрганизации.Банк.Код КАК БИК,
		|	РеализацияТоваровУслугТовары.Ссылка.БанковскийСчетОрганизации.НомерСчета КАК НомерСчета
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Реализация
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка.Дата,
		|	РеализацияТоваровУслугТовары.Ссылка.Договор.Номер,
		|	РеализацияТоваровУслугТовары.Ссылка.ВалютаВзаиморасчетов,
		|	РеализацияТоваровУслугТовары.Ссылка.ВалютаВзаиморасчетов.Наименование,
		|	РеализацияТоваровУслугТовары.Ссылка.БанковскийСчетОрганизации.Банк.Наименование,
		|	РеализацияТоваровУслугТовары.Ссылка.БанковскийСчетОрганизации.Банк.Код,
		|	РеализацияТоваровУслугТовары.Ссылка.БанковскийСчетОрганизации.НомерСчета";
		
		Запрос.УстановитьПараметр("Реализация", Реализация);
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.Дата КАК ДатаДокумента,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.Договор.Номер КАК НомерДоговора,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.ВалютаВзаиморасчетов.Наименование КАК ВалютаВзаиморасчетовНаименование,
		|	СУММА(КорректировкаРеализацииТовары.СуммаСНДС) КАК СуммаСНДС,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.БанковскийСчетОрганизации.Банк.Наименование КАК НаимБанк,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.БанковскийСчетОрганизации.Банк.Код КАК БИК,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.БанковскийСчетОрганизации.НомерСчета КАК НомерСчета
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &Корректировка
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.Дата,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.Договор.Номер,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.ВалютаВзаиморасчетов,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.ВалютаВзаиморасчетов.Наименование,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.БанковскийСчетОрганизации.Банк.Наименование,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.БанковскийСчетОрганизации.Банк.Код,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументОснование.БанковскийСчетОрганизации.НомерСчета";
		
		Запрос.УстановитьПараметр("Корректировка", СчетФактура.ДокументОснование);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		// Вообще с курсом неоднозначно. Если бы была предоплата, то курс нужно было бы рассчитывать по регистру сведений СуммыДокументовВВалютеРегл.
		// Но тогда непонятно какую дату брать, т.к. это был бы курс не какой-то одной даты, а курс остатка долга.
		// Также непонятно какую сумму выводить в данном случае: сумму документа или сумму остатка долга.
		// На текущий момент (26.09.2018) "Проктер & Гэмбл-Новомосковск" не имеет счетов на предоплату, поэтому пока сделаем по-простому:
		// Дата = дата документа, курс будем брать на дату документа, сумма счета = сумма документа
		ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
		Если Выборка.ВалютаВзаиморасчетов = ВалютаРегл Тогда
			КурсДокумента = 1;
		Иначе
			КурсДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетов, Выборка.ДатаДокумента).Курс;
		КонецЕсли;
		//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "вид_документа", "Д000118"));
		//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "номер_документа", Выборка.НомерДоговора));
		//Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "дата_документа", Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yy")));
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "НаимБанк", Выборка.НаимБанк));
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "БИК", Выборка.БИК));
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "НомерСчета", Выборка.НомерСчета));
		Если ЗначениеЗаполнено(СтрокаРО) Тогда
			Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "РО", СтрокаРО));
		КонецЕсли;
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "Валюта", Выборка.ВалютаВзаиморасчетовНаименование));
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "СуммаУслЕд", Выборка.СуммаСНДС));
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "Курс", КурсДокумента));
		Content.AdditionalInfoId.StructedAdditionalInfos.Добавить(Новый Структура("Key,Value", "ДатаКурса", Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy")));
	КонецЕсли;
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 22.10.2018
